RIET/src/InformationRegisters/StagesOfTransportRequests/StagesOfTransportRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTransportRequests</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TransportRequestStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/TransportRequestStages/TransportRequestStages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TransportRequestStages</name>
  <enumValues>
    <name>Draft</name>
  </enumValues>
  <enumValues>
    <name>Requested</name>
  </enumValues>
  <enumValues>
    <name>AcceptedBySpecialist</name>
  </enumValues>
  <enumValues>
    <name>PartiallyShipped</name>
  </enumValues>
  <enumValues>
    <name>CompletelyShipped</name>
  </enumValues>
  <enumValues>
    <name>PartiallyDelivered</name>
  </enumValues>
  <enumValues>
    <name>CompletelyDelivered</name>
  </enumValues>
</mdclass:Enum>

RIET/src/InformationRegisters/StagesOfTransportRequests/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
					
		КлючЗаписи = Неопределено;
		
		Если НЕ ЗначениеЗаполнено(Запись.TransportRequest) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Transport request"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "TransportRequest", "Запись", Отказ);			
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Запись.Stage) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Stage"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "Stage", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.ModificationDate) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Modification date"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "ModificationDate", "Запись", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКлючЗаписи(Запись, КлючЗаписи)
	
	Если КлючЗаписи = Неопределено Тогда
		СтруктураЗаписи = Новый Структура("TransportRequest");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		КлючЗаписи = РегистрыСведений.StagesOfTransportRequests.СоздатьКлючЗаписи(СтруктураЗаписи);
	КонецЕсли; 
		
	Возврат КлючЗаписи;
	
КонецФункции

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() <> "SLI RU" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Stage = Перечисления.TransportRequestStages.CompletelyDelivered Тогда
			ПроцедурыОбменаДанными.ЗаписатьДляОтложеннойРегистрации(Запись.TransportRequest,"СправочникДокумент");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
